# Data Exploration and Cleaning of Fake Job Postings Data Set

In [1]:
# import libraries
import numpy as np
import os
import pandas as pd

In [2]:
# Adjust some pandas' display options
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', 100)
pd.set_option('display.float_format', lambda x: '%.4f' % x)

## Data Exploration

In [3]:
# import data and have a peek at the first 3 rows
df = pd.read_csv('C:/Users/nickm/Desktop/Coding/Projects/fake-job-postings/fake_job_postings.csv')
df.head(3)

,job_id,title,location,department,salary_range,company_profile,description,requirements,benefits,telecommuting,has_company_logo,has_questions,employment_type,required_experience,required_education,industry,function,fraudulent
0,1,Marketing Intern,"US, NY, New York",Marketing,NaN,"We're Food52, and we've created a groundbreaki...","Food52, a fast-growing, James Beard Award-winn...",Experience with content management systems a m...,NaN,0,1,0,Other,Internship,NaN,NaN,Marketing,0
1,2,Customer Service - Cloud Video Production,"NZ, , Auckland",Success,NaN,"90 Seconds, the worlds Cloud Video Production ...",Organised - Focused - Vibrant - Awesome!Do you...,What we expect from you:Your key responsibilit...,What you will get from usThrough being part of...,0,1,0,Full-time,Not Applicable,NaN,Marketing and Advertising,Customer Service,0
2,3,Commissioning Machinery Assistant (CMA),"US, IA, Wever",NaN,NaN,Valor Services provides Workforce Solutions th...,"Our client, located in Houston, is actively se...",Implement pre-commissioning and commissioning ...,NaN,0,1,0,NaN,NaN,NaN,NaN,NaN,0

In [4]:
# Display DataFrame summary
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17880 entries, 0 to 17879
Data columns (total 18 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   job_id               17880 non-null  int64
 1   title                17880 non-null  object
 2   location             17534 non-null  object
 3   department           6333 non-null   object
 4   salary_range         2868 non-null   object
 5   company_profile      14572 non-null  object
 6   description          17879 non-null  object
 7   requirements         15184 non-null  object
 8   benefits             10668 non-null  object
 9   telecommuting        17880 non-null  int64
 10  has_company_logo     17880 non-null  int64
 11  has_questions        17880 non-null  int64
 12  employment_type      14409 non-null  object
 13  required_experience  10830 non-null  object
 14  required_education   9775 non-null   object
 15  industry             12977 non-null  object
 16  function             11425 non-null  object
 17  fraudulent           17880 non-null  int64
dtypes: int64(5), object(13)
memory usage: 2.5+ MB

In [5]:
# Count number of unique values in each column
df.nunique()

job_id                 17880
title                  11231
location                3105
department              1337
salary_range             874
company_profile         1709
description            14801
requirements           11967
benefits                6204
telecommuting              2
has_company_logo           2
has_questions              2
employment_type            5
required_experience        7
required_education        13
industry                 131
function                  37
fraudulent                 2
dtype: int64

In [6]:
# Show share of missing values in columns
df.isna().sum()/len(df)*100

job_id                 0.0000
title                  0.0000
location               1.9351
department            64.5805
salary_range          83.9597
company_profile       18.5011
description            0.0056
requirements          15.0783
benefits              40.3356
telecommuting          0.0000
has_company_logo       0.0000
has_questions          0.0000
employment_type       19.4128
required_experience   39.4295
required_education    45.3300
industry              27.4217
function              36.1018
fraudulent             0.0000
dtype: float64

In [7]:
# Store top 3 unique values in all columns
column = []
characteristic = []
valuecount = []

topx = 3

for c in df.columns:
    n = min(topx, len(df[c].value_counts()))
    column.extend(*[[c]*n])
    characteristic.extend(df[c].value_counts().head(topx).index)
    valuecount.extend(np.round(df[c].value_counts().head(topx).values/len(df)*100, 2))

In [8]:
# Show values
stats = pd.DataFrame({'column': column, 'characteristic': characteristic, 'valuecount_in_percent': valuecount})
stats

,column,characteristic,valuecount_in_percent
0,job_id,1,0.0100
1,job_id,11919,0.0100
2,job_id,11925,0.0100
3,title,English Teacher Abroad,1.7400
4,title,Customer Service Associate,0.8200
5,title,Graduates: English Teacher Abroad (Conversatio...,0.8100
6,location,"GB, LND, London",4.0200
7,location,"US, NY, New York",3.6800
8,location,"US, CA, San Francisco",2.6400
9,department,Sales,3.0800
10,department,Engineering,2.7200
11,department,Marketing,2.2400
12,salary_range,0-0,0.7900
13,salary_range,40000-50000,0.3700
14,salary_range,30000-40000,0.3100
15,company_profile,We help teachers get safe &amp; secure jobs ab...,4.0600
16,company_profile,We Provide Full Time Permanent Positions for m...,3.7700
17,company_profile,"Novitex Enterprise Solutions, formerly Pitney ...",3.2100
18,description,"Play with kids, get paid for it Love travel? J...",2.1200
19,description,"Play with kids, get paid for it :-)Love travel...",0.3700
20,description,"Play with kids, get paid for it Love travel? J...",0.2600
21,requirements,University degree required. TEFL / TESOL / CEL...,2.2900
22,requirements,University degree required. TEFL / TESOL / CEL...,0.9100
23,requirements,16-18 year olds only due to government funding...,0.6500
24,benefits,See job description,4.0600
25,benefits,Career prospects.,0.8800
26,benefits,CSD offers a competitive benefits package for ...,0.3900
27,telecommuting,0,95.7100
28,telecommuting,1,4.2900
29,has_company_logo,1,79.5300
30,has_company_logo,0,20.4700
31,has_questions,0,50.8300
32,has_questions,1,49.1700
33,employment_type,Full-time,64.9900
34,employment_type,Contract,8.5200
35,employment_type,Part-time,4.4600
36,required_experience,Mid-Senior level,21.3000
37,required_experience,Entry level,15.0800
38,required_experience,Associate,12.8500
39,required_education,Bachelor's Degree,28.7800
40,required_education,High School or equivalent,11.6300
41,required_education,Unspecified,7.8100
42,industry,Information Technology and Services,9.7000
43,industry,Computer Software,7.7000
44,industry,Internet,5.9400
45,function,Information Technology,9.7800
46,function,Sales,8.2100
47,function,Engineering,7.5400
48,fraudulent,0,95.1600
49,fraudulent,1,4.8400

## Recodes

### Text presence

In [9]:
# define columns which contain descriptive texts of the job posting
cols = ['company_profile', 'description', 'requirements', 'benefits']

for c in cols:
    df[f'has_{c}'] = np.where(df[c].notna(), 1, 0)

In [10]:
# see columns
check_cols = cols + [f'has_{c}' for c in cols]
df[check_cols].head(3)

,company_profile,description,requirements,benefits,has_company_profile,has_description,has_requirements,has_benefits
0,"We're Food52, and we've created a groundbreaki...","Food52, a fast-growing, James Beard Award-winn...",Experience with content management systems a m...,NaN,1,1,1,0
1,"90 Seconds, the worlds Cloud Video Production ...",Organised - Focused - Vibrant - Awesome!Do you...,What we expect from you:Your key responsibilit...,What you will get from usThrough being part of...,1,1,1,1
2,Valor Services provides Workforce Solutions th...,"Our client, located in Houston, is actively se...",Implement pre-commissioning and commissioning ...,NaN,1,1,1,0

### Text lengths

In [11]:
# merge all columns with job texts into one column
df['job_posting'] = df[cols].fillna('').agg(' | '.join, axis=1)

In [12]:
# store character length of each text
cols.append('job_posting')

for c in cols:
    df[f'{c}_length'] = df[c].str.len()

In [13]:
# see columns
df.filter(like='_length').head()

,company_profile_length,description_length,requirements_length,benefits_length,job_posting_length
0,885.0000,905.0000,852.0000,NaN,2651
1,1286.0000,2077.0000,1433.0000,1292.0000,6097
2,879.0000,355.0000,1363.0000,NaN,2606
3,614.0000,2600.0000,1429.0000,782.0000,5434
4,1628.0000,1520.0000,757.0000,21.0000,3935

In [14]:
# show descriptive statistics
df.filter(like='_length').describe()

,company_profile_length,description_length,requirements_length,benefits_length,job_posting_length
count,14572.0000,17879.0000,15184.0000,10668.0000,17880.0000
mean,761.8527,1218.0725,694.9133,350.1176,2646.9338
std,536.3917,894.8073,608.2358,375.4889,1465.7626
min,9.0000,6.0000,1.0000,1.0000,9.0000
25%,392.0000,607.0000,301.0000,91.0000,1559.0000
50%,684.0000,1017.0000,562.0000,237.0000,2499.0000
75%,1022.0000,1586.0000,904.0000,488.0000,3447.0000
max,6178.0000,14907.0000,10864.0000,4429.0000,14916.0000

### Country, State and City

In [15]:
# Break down the location column into country, state and city.
# E.g.: 'GB, LND, London'; 'US, NY, New York'
# -> Split Column by comma
country_state_city = df['location'].str.split(pat=', ', expand=True)
country_state_city.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,US,NY,New York,None,None,None,None,None,None,None,None,None,None,None,None,None
1,NZ,,Auckland,None,None,None,None,None,None,None,None,None,None,None,None,None
2,US,IA,Wever,None,None,None,None,None,None,None,None,None,None,None,None,None
3,US,DC,Washington,None,None,None,None,None,None,None,None,None,None,None,None,None
4,US,FL,Fort Worth,None,None,None,None,None,None,None,None,None,None,None,None,None

In [16]:
# For some postings, the format either differs, or there are multiple locations stated
country_state_city.sort_values(by=4).head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
4480,US,CA,San Jose,SFO,Austin,OH,None,None,None,None,None,None,None,None,None,None
17571,US,FL,"Orlando,Lake City","Jacksonville,Atlanta,Ocala,Miami,Asbury Park NJ",Belmar NJ,Toms River NJ.,None,None,None,None,None,None,None,None,None,None
4650,US,FL,Central Fl,Nort Fl,Georgia,Alabama,"Tennessee,South Carolina,North Carolina",None,None,None,None,None,None,None,None,None
1725,US,TX,Austin,San Antonio,Houston,None,None,None,None,None,None,None,None,None,None,None
4396,US,MI,Hartford,Paw Paw,Lawton,None,None,None,None,None,None,None,None,None,None,None

In [17]:
# How many postings have more than one location (or differ in format)
len(df) - country_state_city.isna().sum()

0     17534
1     17440
2     17440
3       118
4        13
5         7
6         2
7         1
8         1
9         1
10        1
11        1
12        1
13        1
14        1
15        1
dtype: int64

In [18]:
# of those 118 postings that have more than 3 postings (see column 3), what information is stored in these extra columns?
country_state_city[[0,1,2,3]].loc[country_state_city[3].notna()].head(10)

      0    1            2              3
16   IL          Tel Aviv         Israel
69   US   CA   Menlo Park             CA
98   US           Stocton             CA
215  US   CA  Bakersfield  CA / Mt. Poso
219  SA   01       Riyadh          Olaya
314  EG    C        Cairo      Nasr City
343  GR    I  Neo Iraklio         Athens
440  GB  UKM    Stockholm         Sweden
695  GB             Angel         London
980  US   CO      Boulder             CO

In [19]:
# The information in those extra columns seems to be mostly repetitve (e.g. the state again)
# Therefore, these columns will be ignored and only the first 3 columns will be used to determine
# the country, state and city of a job posting

df['location_country'] = np.where(country_state_city[0] != '', country_state_city[0], np.nan)
df['location_state'] = np.where(country_state_city[1] != '', country_state_city[1], np.nan)
df['location_city'] = np.where(country_state_city[2] != '', country_state_city[2], np.nan)

In [20]:
# show created location columns
df.filter(like='location').head()

             location location_country location_state location_city
0    US, NY, New York               US             NY      New York
1      NZ, , Auckland               NZ            NaN      Auckland
2       US, IA, Wever               US             IA         Wever
3  US, DC, Washington               US             DC    Washington
4  US, FL, Fort Worth               US             FL    Fort Worth

In [21]:
# show value counts of unique countries present
df['location_country'].value_counts().head()

location_country
US    10656
GB     2384
GR      940
CA      457
DE      383
Name: count, dtype: int64

In [22]:
# show value counts of unique states
df['location_state'].value_counts().head()

location_state
CA     2051
NY     1259
LND     992
TX      975
I       688
Name: count, dtype: int64

In [23]:
# show value counts of unique cities
df['location_city'].value_counts().head()

location_city
London           1060
New York          669
Athens            543
San Francisco     478
Houston           271
Name: count, dtype: int64

### Salary Range

#### Quality Check and Cleaning

In [24]:
# Only 2868 of the 17880 job postings (~16%) have provided a salary range
print('salary_range not missing\nn:', df['salary_range'].notna().sum())
print('%:', round(df['salary_range'].notna().sum()/len(df), 2))

salary_range not missing
n: 2868
%: 0.16

In [25]:
# Show frequency of stated salary ranges
df.loc[df['salary_range'].notna(), 'salary_range'].value_counts().head(10)

salary_range
0-0             142
40000-50000      66
30000-40000      55
25000-30000      37
45000-67000      37
30000-50000      32
35000-45000      30
80000-100000     30
70000-90000      30
50000-80000      29
Name: count, dtype: int64

In [26]:
# There are some containing the value '0-0', which should be recorded to missing
df['salary_range'] = np.where(df['salary_range'] == '0-0', np.nan, df['salary_range'])

In [27]:
# Show sorted values
df.loc[df['salary_range'].notna(), 'salary_range'].sort_values()

3442          0-1
343        0-1000
16125      0-1000
1599       0-1000
10997    0-100000
           ...
17656      Dec-25
10316      Jun-18
2313       Oct-15
9911       Oct-20
14196      Oct-20
Name: salary_range, Length: 2726, dtype: object

In [28]:
# There are values which are possibly incorrectly recoded and therefore show a date.
# E.g.: 'Dec-25', 'Oct-20', could be '12-25' or '10-20'
# Since we can't be sure, we'll exclude all values that contain any letter
df['salary_range'] = np.where(df['salary_range'].str.contains(r'[a-zA-Z]'), np.nan, df['salary_range'])

In [29]:
# Show sorted values again
df.loc[df['salary_range'].notna(), 'salary_range'].sort_values()

3442                0-1
343              0-1000
16125            0-1000
1599             0-1000
10997          0-100000
              ...
2384     960000-1200000
2820     960000-1200000
13677           962-962
8964        99000-99999
9659        99000-99999
Name: salary_range, Length: 2700, dtype: object

In [30]:
# show first values of column
df.loc[df['salary_range'].notna(), 'salary_range'].head(10)

6       20000-28000
10    100000-120000
15    120000-150000
23    100000-120000
31      50000-65000
42      40000-50000
65            60-80
76      65000-70000
77           75-115
79     75000-110000
Name: salary_range, dtype: object

In [31]:
# Most of these values seem to depict the yearly range of salaries. However, some are
# either hourly ranges, or yearly ranges but in k [currency]
# E.g.: '60-80' or '75-115'

#### Create new columns: 'salary_range_from' and 'salary_range_to'

##### Create Columns

In [32]:
# Let's split this column into 'from' and 'to'
df[['salary_range_from', 'salary_range_to']] = df['salary_range'].str.split(pat='-', expand=True).apply(pd.to_numeric)

In [33]:
# Show original and new columns
df.loc[df['salary_range'].notna()].filter(like='salary').head(10)

     salary_range  salary_range_from  salary_range_to
6     20000-28000         20000.0000       28000.0000
10  100000-120000        100000.0000      120000.0000
15  120000-150000        120000.0000      150000.0000
23  100000-120000        100000.0000      120000.0000
31    50000-65000         50000.0000       65000.0000
42    40000-50000         40000.0000       50000.0000
65          60-80            60.0000          80.0000
76    65000-70000         65000.0000       70000.0000
77         75-115            75.0000         115.0000
79   75000-110000         75000.0000      110000.0000

##### Quality Check and Cleaning

In [34]:
# Show distribution
df.filter(like='salary_range_').describe()

       salary_range_from  salary_range_to
count          2700.0000        2699.0000
mean         542516.7526      855322.5936
std        18152191.5368    27759604.2791
min               0.0000           1.0000
25%           20000.0000       30000.0000
50%           40000.0000       52000.0000
75%           60000.0000       90000.0000
max       800000000.0000  1200000000.0000

In [35]:
# The max value seems extremely high. Let's have a closer look at this case in our DataFrame.
df.loc[df['salary_range']=='800000000-1200000000']

,job_id,title,location,department,salary_range,company_profile,description,requirements,benefits,telecommuting,has_company_logo,has_questions,employment_type,required_experience,required_education,industry,function,fraudulent,has_company_profile,has_description,has_requirements,has_benefits,job_posting,company_profile_length,description_length,requirements_length,benefits_length,job_posting_length,location_country,location_state,location_city,salary_range_from,salary_range_to
3139,3140,National Sales Manager,"ID, JW, Jakarta",Danone - Sari Husada,800000000-1200000000,Local expertise with an international perspect...,Sari Husada is a member of a leading food and ...,The candidates will required to have a univers...,.../...,0,1,0,Full-time,Mid-Senior level,Bachelor's Degree,Consumer Goods,Sales,0,1,1,1,1,Local expertise with an international perspect...,1067.0000,733.0000,608.0000,7.0000,2424,ID,JW,Jakarta,800000000.0000,1200000000.0000

In [36]:
# This case might state the salary range in Indonesian Rupiah. 
# Show top 3 values.
df.sort_values(by='salary_range_from', ascending=False).head(3)

,job_id,title,location,department,salary_range,company_profile,description,requirements,benefits,telecommuting,has_company_logo,has_questions,employment_type,required_experience,required_education,industry,function,fraudulent,has_company_profile,has_description,has_requirements,has_benefits,job_posting,company_profile_length,description_length,requirements_length,benefits_length,job_posting_length,location_country,location_state,location_city,salary_range_from,salary_range_to
3139,3140,National Sales Manager,"ID, JW, Jakarta",Danone - Sari Husada,800000000-1200000000,Local expertise with an international perspect...,Sari Husada is a member of a leading food and ...,The candidates will required to have a univers...,.../...,0,1,0,Full-time,Mid-Senior level,Bachelor's Degree,Consumer Goods,Sales,0,1,1,1,1,Local expertise with an international perspect...,1067.0000,733.0000,608.0000,7.0000,2424,ID,JW,Jakarta,800000000.0000,1200000000.0000
12251,12252,Sales Manager - General Trade,"ID, JW, Jakarta",Arc Int.,500000000-800000000,Local expertise with an international perspect...,Client - ARC InternationalArc International is...,Driven and result orientedStrong in leadership...,TBA,0,1,0,Full-time,Mid-Senior level,Bachelor's Degree,Consumer Goods,Sales,0,1,1,1,1,Local expertise with an international perspect...,1067.0000,1342.0000,230.0000,3.0000,2651,ID,JW,Jakarta,500000000.0000,800000000.0000
5073,5074,Junior Engineer/Engineering Technician,"US, CA, San Jose","Engineering, Pipeline Design",6266624-8582080,NaN,"Founded in 1866, San Jose Water Company is an...",Required Knowledge and Skills:Useful and profi...,San Jose Water Company offers a very comprehen...,0,0,1,Full-time,Entry level,Associate Degree,Utilities,Engineering,1,0,1,1,1,"| Founded in 1866, San Jose Water Company is...",NaN,1307.0000,1058.0000,168.0000,2542,US,CA,San Jose,6266624.0000,8582080.0000

In [37]:
# The 2 highest (by far) are both from Indonesia.
# Inspect all salary_ranges from Indonesia
df.loc[(df['location_country']=='ID') & (df['salary_range'].notna())]

,job_id,title,location,department,salary_range,company_profile,description,requirements,benefits,telecommuting,has_company_logo,has_questions,employment_type,required_experience,required_education,industry,function,fraudulent,has_company_profile,has_description,has_requirements,has_benefits,job_posting,company_profile_length,description_length,requirements_length,benefits_length,job_posting_length,location_country,location_state,location_city,salary_range_from,salary_range_to
3139,3140,National Sales Manager,"ID, JW, Jakarta",Danone - Sari Husada,800000000-1200000000,Local expertise with an international perspect...,Sari Husada is a member of a leading food and ...,The candidates will required to have a univers...,.../...,0,1,0,Full-time,Mid-Senior level,Bachelor's Degree,Consumer Goods,Sales,0,1,1,1,1,Local expertise with an international perspect...,1067.0000,733.0000,608.0000,7.0000,2424,ID,JW,Jakarta,800000000.0000,1200000000.0000
5907,5908,Become a co-Director in Indonesia,"ID, , Medan",NaN,750-750,NaN,If you’re looking for a long-term volunteering...,Those who are secure without the comforts of h...,Stipend: Volunteers must commit to serve at le...,0,0,0,Full-time,Not Applicable,Unspecified,Education Management,Education,0,0,1,1,1,| If you’re looking for a long-term volunteer...,NaN,2299.0000,607.0000,657.0000,3572,ID,NaN,Medan,750.0000,750.0000
9341,9342,Executive Search Consultant,"ID, JW, Jakarta",Wisma Metropolitan I,25000-35000,Local expertise with an international perspect...,"Passionate about your Clients’ business, you a...","Driven and Motivated, you are an out-going and...",Facing demanding Clients and extraordinary cha...,0,1,1,Full-time,Associate,Bachelor's Degree,Staffing and Recruiting,Consulting,0,1,1,1,1,Local expertise with an international perspect...,1067.0000,720.0000,599.0000,569.0000,2964,ID,JW,Jakarta,25000.0000,35000.0000
12251,12252,Sales Manager - General Trade,"ID, JW, Jakarta",Arc Int.,500000000-800000000,Local expertise with an international perspect...,Client - ARC InternationalArc International is...,Driven and result orientedStrong in leadership...,TBA,0,1,0,Full-time,Mid-Senior level,Bachelor's Degree,Consumer Goods,Sales,0,1,1,1,1,Local expertise with an international perspect...,1067.0000,1342.0000,230.0000,3.0000,2651,ID,JW,Jakarta,500000000.0000,800000000.0000

In [38]:
# Let's convert the constructed values into USD for those cases.
# As of today (03/13/2024), the exchange rate is 1 USD = 15,574.35 IDR
idr_to_usd = 15_574.35
df['salary_range_from'] = np.where((df['location_country']=='ID') & (df['salary_range'].notna()),
                                   df['salary_range_from']/idr_to_usd,
                                   df['salary_range_from'])
df['salary_range_to'] = np.where((df['location_country']=='ID') & (df['salary_range'].notna()),
                                 df['salary_range_to']/idr_to_usd,
                                 df['salary_range_to'])

In [39]:
# Check results (values might be in hourly income, or yearly income in 1000 IDR)
df.loc[(df['location_country']=='ID') & (df['salary_range'].notna())].filter(like='salary')

               salary_range  salary_range_from  salary_range_to
3139   800000000-1200000000         51366.5097       77049.7645
5907                750-750             0.0482           0.0482
9341            25000-35000             1.6052           2.2473
12251   500000000-800000000         32104.0685       51366.5097

In [40]:
# Check how many nonmissing values there are
df.filter(like='salary').notna().sum()

salary_range         2700
salary_range_from    2700
salary_range_to      2699
dtype: int64

In [41]:
# In one case we only have a value for the lower part of the range
df.loc[(df['salary_range_from'].notna()) & (df['salary_range_to'].isna())]

,job_id,title,location,department,salary_range,company_profile,description,requirements,benefits,telecommuting,has_company_logo,has_questions,employment_type,required_experience,required_education,industry,function,fraudulent,has_company_profile,has_description,has_requirements,has_benefits,job_posting,company_profile_length,description_length,requirements_length,benefits_length,job_posting_length,location_country,location_state,location_city,salary_range_from,salary_range_to
5538,5539,Inside Sales Magazine Advertising,"US, CA, Yorba Linda",NaN,40000,NaN,"​IMPORTANT: TO BE CONSIDERED, PLEASE SEND YOUR...",Desired Skills and ExperienceThe following att...,This full time position includes a COMPETITIVE...,0,1,1,Full-time,Associate,Bachelor's Degree,Publishing,Accounting/Auditing,0,0,1,1,1,"| ​IMPORTANT: TO BE CONSIDERED, PLEASE SEND Y...",NaN,340.0000,2011.0000,256.0000,2616,US,CA,Yorba Linda,40000.0000,NaN

In [42]:
# Store ID for recode and check
check_id = df.loc[(df['salary_range_from'].notna()) & (df['salary_range_to'].isna())].index
check_id

Index([5538], dtype='int64')

In [43]:
# This job offer stated the anticipated final pay instead of a range.
# We'll just use this value to fill the 'to' column
# df['salary_range_to'] = np.where((df['salary_range_from'].notna()) & (df['salary_range_to'].isna()),
#                                  df['salary_range_from'],
#                                  df['salary_range_to'])
df.loc[check_id, 'salary_range_to'] = df.loc[check_id, 'salary_range_from']
df.filter(like='salary').iloc[check_id]

     salary_range  salary_range_from  salary_range_to
5538        40000         40000.0000       40000.0000

#### Create new columns: 'salary_range_mid' and 'salary_range_peak_to_peak'

In [44]:
# Create a column containing the midpoint of the stated salary range.
df['salary_range_mid'] = np.mean(df[['salary_range_from', 'salary_range_to']], axis=1)

In [45]:
# Create a column containing the range (max-min) of the salary range.
df['salary_range_peak_to_peak'] = np.ptp(df[['salary_range_from', 'salary_range_to']], axis=1)

In [46]:
# Show columns
df.filter(like='salary').loc[df['salary_range'].notna()].head()

,salary_range,salary_range_from,salary_range_to,salary_range_mid,salary_range_peak_to_peak
6,20000-28000,20000.0000,28000.0000,24000.0000,8000.0000
10,100000-120000,100000.0000,120000.0000,110000.0000,20000.0000
15,120000-150000,120000.0000,150000.0000,135000.0000,30000.0000
23,100000-120000,100000.0000,120000.0000,110000.0000,20000.0000
31,50000-65000,50000.0000,65000.0000,57500.0000,15000.0000

#### Create new column: 'has_salary_range'

In [47]:
# Create binary variable depicting whether a salary range is stated in the job listing.
df['has_salary_range'] = np.where(df['salary_range'].notna(), 1, 0)
df['has_salary_range'].value_counts()

has_salary_range
0    15180
1     2700
Name: count, dtype: int64

### One Hot Encoding of 'employment_type', 'required_experience' and 'required_education'

In [48]:
# Define columns to work with
one_hot_columns = ['employment_type', 'required_experience', 'required_education']

In [49]:
# Show unique values and corresponding counts of these columns#
for col in one_hot_columns:
    print(df[col].value_counts(), '\n')

employment_type
Full-time    11620
Contract      1524
Part-time      797
Temporary      241
Other          227
Name: count, dtype: int64

required_experience
Mid-Senior level    3809
Entry level         2697
Associate           2297
Not Applicable      1116
Director             389
Internship           381
Executive            141
Name: count, dtype: int64

required_education
Bachelor's Degree                    5145
High School or equivalent            2080
Unspecified                          1397
Master's Degree                       416
Associate Degree                      274
Certification                         170
Some College Coursework Completed     102
Professional                           74
Vocational                             49
Some High School Coursework            27
Doctorate                              26
Vocational - HS Diploma                 9
Vocational - Degree                     6
Name: count, dtype: int64

In [50]:
# One hot encoding
dummies = pd.get_dummies(df[one_hot_columns])

In [51]:
# Merge dummies to df
df = pd.concat([df, dummies], axis=1)

In [52]:
# Check columns
df[dummies.columns].sum()

employment_type_Contract                                 1524
employment_type_Full-time                               11620
employment_type_Other                                     227
employment_type_Part-time                                 797
employment_type_Temporary                                 241
required_experience_Associate                            2297
required_experience_Director                              389
required_experience_Entry level                          2697
required_experience_Executive                             141
required_experience_Internship                            381
required_experience_Mid-Senior level                     3809
required_experience_Not Applicable                       1116
required_education_Associate Degree                       274
required_education_Bachelor's Degree                     5145
required_education_Certification                          170
required_education_Doctorate                               26
required_education_High School or equivalent             2080
required_education_Master's Degree                        416
required_education_Professional                            74
required_education_Some College Coursework Completed      102
required_education_Some High School Coursework             27
required_education_Unspecified                           1397
required_education_Vocational                              49
required_education_Vocational - Degree                      6
required_education_Vocational - HS Diploma                  9
dtype: int64

## Store DF for further analyses

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17880 entries, 0 to 17879
Data columns (total 61 columns):
 #   Column                                                Non-Null Count  Dtype
---  ------                                                --------------  -----
 0   job_id                                                17880 non-null  int64
 1   title                                                 17880 non-null  object
 2   location                                              17534 non-null  object
 3   department                                            6333 non-null   object
 4   salary_range                                          2700 non-null   object
 5   company_profile                                       14572 non-null  object
 6   description                                           17879 non-null  object
 7   requirements                                          15184 non-null  object
 8   benefits                                              10668 non-null  object
 9   telecommuting                                         17880 non-null  int64
 10  has_company_logo                                      17880 non-null  int64
 11  has_questions                                         17880 non-null  int64
 12  employment_type                                       14409 non-null  object
 13  required_experience                                   10830 non-null  object
 14  required_education                                    9775 non-null   object
 15  industry                                              12977 non-null  object
 16  function                                              11425 non-null  object
 17  fraudulent                                            17880 non-null  int64
 18  has_company_profile                                   17880 non-null  int32
 19  has_description                                       17880 non-null  int32
 20  has_requirements                                      17880 non-null  int32
 21  has_benefits                                          17880 non-null  int32
 22  job_posting                                           17880 non-null  object
 23  company_profile_length                                14572 non-null  float64
 24  description_length                                    17879 non-null  float64
 25  requirements_length                                   15184 non-null  float64
 26  benefits_length                                       10668 non-null  float64
 27  job_posting_length                                    17880 non-null  int64
 28  location_country                                      17534 non-null  object
 29  location_state                                        15300 non-null  object
 30  location_city                                         15813 non-null  object
 31  salary_range_from                                     2700 non-null   float64
 32  salary_range_to                                       2700 non-null   float64
 33  salary_range_mid                                      2700 non-null   float64
 34  salary_range_peak_to_peak                             2700 non-null   float64
 35  has_salary_range                                      17880 non-null  int32
 36  employment_type_Contract                              17880 non-null  bool
 37  employment_type_Full-time                             17880 non-null  bool
 38  employment_type_Other                                 17880 non-null  bool
 39  employment_type_Part-time                             17880 non-null  bool
 40  employment_type_Temporary                             17880 non-null  bool
 41  required_experience_Associate                         17880 non-null  bool
 42  required_experience_Director                          17880 non-null  bool
 43  required_experience_Entry level                       17880 non-null  bool
 44  required_experience_Executive                         17880 non-null  bool
 45  required_experience_Internship                        17880 non-null  bool
 46  required_experience_Mid-Senior level                  17880 non-null  bool
 47  required_experience_Not Applicable                    17880 non-null  bool
 48  required_education_Associate Degree                   17880 non-null  bool
 49  required_education_Bachelor's Degree                  17880 non-null  bool
 50  required_education_Certification                      17880 non-null  bool
 51  required_education_Doctorate                          17880 non-null  bool
 52  required_education_High School or equivalent          17880 non-null  bool
 53  required_education_Master's Degree                    17880 non-null  bool
 54  required_education_Professional                       17880 non-null  bool
 55  required_education_Some College Coursework Completed  17880 non-null  bool
 56  required_education_Some High School Coursework        17880 non-null  bool
 57  required_education_Unspecified                        17880 non-null  bool
 58  required_education_Vocational                         17880 non-null  bool
 59  required_education_Vocational - Degree                17880 non-null  bool
 60  required_education_Vocational - HS Diploma            17880 non-null  bool
dtypes: bool(25), float64(8), int32(5), int64(6), object(17)
memory usage: 5.0+ MB

In [54]:
df.to_csv('fake_job_postings_CLEANED_RECODED.csv', encoding='utf-8', index=False)
df.to_csv('fake_job_postings_CLEANED_RECODED.gzip', encoding='utf-8', index=False, compression='gzip')

In [55]:
# Compare file sizes
csv_filesize = os.path.getsize('fake_job_postings_CLEANED_RECODED.csv') / 1024**2
gzip_filesize = os.path.getsize('fake_job_postings_CLEANED_RECODED.gzip') / 1024**2

In [56]:
print(f'csv:  {csv_filesize:.2f} MB')
print(f'gzip: {gzip_filesize:.2f} MB')

csv:  96.98 MB
gzip: 18.62 MB